{"type":"game","name":"XField Paintball 3","steam_appid":377510,"required_age":0,"is_free":false,"detailed_description":"<h2 class=\"bb_tag\">Foreword from the Team</h2><strong>XFP3 is a game in early stage and permanent development with the community.</strong><br><br>Warning: Non paintball players might find this sport gameplay too disruptive compared to traditional FPS.<h2 class=\"bb_tag\">What is now included in XFP3?</h2>- A very realistic paintball physics engine reproducing the unique paintball shooting lines (air friction simulation).<br><br>- Quick play mode (real time multiplayer): 1v1 to 5v5 (adjusted by the dev team to reduce waiting time on servers).<br>- Walk in the Field – WIF (solo mode): For tutorial purpose, or IRL competition paintballers training.<br>- A two phases Gameplay, before and during each round:<br><br>   <strong>1. Before each round - Strategy time: </strong><br>    <ul class=\"bb_ul\">      <li>The captain builds a team strategy and shares it using dedicated communication tools.<br>      </li><li>3 different performance profiles are available:<br>          <ul class=\"bb_ul\">          <li>Tactician with special communication power<br>          </li><li>Rusher with run boost<br>          </li><li>Shooter with accuracy boost<br>          </li></ul>     </li><li>The Captain gives directions to each teammate: where to go and where to shoot…<br>     </li></ul><br>   <strong>2. During each round – Tactical and play time:</strong><br>    <ul class=\"bb_ul\">      <li>Each player uses an original cover mode, with offensive paintball moves (snap, lean, hand switching) while accuracy is boosted vs when running.<br>      </li><li>Each player can use a communication tool for tactics sharing. The tactician is, as IRL, the player who informs the team about opponents’ position. An exclusive power let him do that once a round for a few sec.<br>     </li></ul><br>- Fire rate of 10.5 shots/second and per player (up to 200 simultaneous trajectories).<br>- Official layouts of all international leagues (NXL, Millennium, PALS, CXBL, UWL, SARPL) before the IRL events for training purpose.<br>- Scenario map SC Village.<br>- Progressive low latency servers deployment in USA then in Europe first.<h2 class=\"bb_tag\">What is coming next in matter of days/weeks?</h2>- Server browser (real time multiplayer) : Play 5v5 with friends on your favorite maps.<br>- LAN.<br>- New animation set.<br>- New maps and layouts.<br>- Continuous bug fixing.<h2 class=\"bb_tag\">What is coming next?</h2>- Competitive mode.<br>- Team management.<br>- Field Configurator.<br>- Other community whishes ;-)<h2 class=\"bb_tag\">Why did we make a paintball videogame?</h2><br>Paintball is an amazing sport, offering intense competition and strong team experiences. On the surface it may appear to be a straightforward shooting game, but it is not—strategy is essential for success. Your team’s strategy, tactics and coordination may not be obvious at first sight but make all the difference between mindless shooting and truly playing the sport of paintball.<br><br>There are two more ingredients that make our paintball game unique. The first is realistic ballistics and the second is the maps, or layouts, designed by pros for competitions. The quality of those layouts relies on their real life “level design” that makes them suitable for international competition. We don’t forget the fun of playing on scenario maps with friends where strategy and tactics are also essential.<br><br>The XField Paintball Studio Team wants to create a new video game experience, based on the most realistic and immersive simulation possible of the sport of paintball, including features that reveal the depth and natural gameplay of this sport. The game is developed with pro players to address both the paintball community and the PC player without paintball experience.<br><br>In a nutshell, we want to create the Official Paintball Video Game, based on:<br><ul class=\"bb_ul\"><li>\tA fully immersive technical and design environment.<br></li><li>\tGameplay based on team strategy, tactics and communication.<br></li><li>\tAnd a strong, community-driven update plan.</li></ul><br>Find out below more details on the Gameplay and the Dev Team.<h2 class=\"bb_tag\">**********************************************************************************************</h2><h2 class=\"bb_tag\">The XField Paintball Gameplay</h2><h2 class=\"bb_tag\">Physics As A Gameplay Feature</h2><br>Parabolic shooting provides an amazing in-game experience, quite different from other FPS games. You will need to anticipate every move from your opponent to be a good shooter. The arcing trajectory of a paintball, which is much different than a bullet, allows you to hit an opponent hidden behind the edge of a bunker! The safety zone behind bunkers is smaller than it appears at first sight.<h2 class=\"bb_tag\">Taking Good Cover</h2>It is essential to take good cover and use the shelter that bunkers provide using all sorts of commands such as “change hands” to shoot, lean, snap shots etc…As soon as you get close to the bunker edge or you walk out of cover, you become a shooting target that a good marksman will not miss. This is a one shoot, one kill type of sport, so you want to master bunker’s protection first. Only when your opponent is pinned down under your fire or friendly fire, can you run to your next bunker.<h2 class=\"bb_tag\">Different Player Profiles</h2>Each team is made of several players holding different positions. Each position on the field requires a different mix of the set of skills needed to win (speed, accuracy, communication). The captain chosen at the beginning of each game selects a role for each of the team players according to the planned strategy. Those skills have to be chosen carefully  according to the plan you want to execute.<h2 class=\"bb_tag\">The Captain</h2><br>The Captain, who is chosen randomly at the beginning of each game, designs the strategy and selects all team player profiles, first moves and shooting targets at the beginning of each new round with an easy to use interface:<br><ul class=\"bb_ul\"><li>\tPlayer’s profile (drag &amp; drop selected profile icon on each player)<br></li><li>\tPlayer’s position (move R/L to select player &amp; left click to indicate his position)<br></li><li>\tEach player’s initial shooting target (right click to indicate target)</li></ul><br>All the players of the team can view this, as it is happening and chat live among themselves. We invite players to share and coordinate their strategy at this stage.<br>The Captain’s instruction will be visible up to 15 seconds when the round starts making it easy for each player to memorize his part of the strategy.<br>Team spirit and good communication will help win the game.<h2 class=\"bb_tag\">The 3 Player Profiles (boosted Skills)</h2><img src=\"http://cdn.edgecast.steamstatic.com/steam/apps/377510/extras/Tableau.jpg?t=1498038210\"><h2 class=\"bb_tag\">The “rusher”  (red)</h2>Front players, they run fast, move quickly and are able to play the small and tiny bunkers*, far from the base. They shoot less paint than the second line and third line players. Long distance shooting accuracy is not the main ability of those players. They usually play as front players with an aggressive style; they are creating immediate danger for the opponents. <br>In the game, this kind of player has a red color. <br>He runs 10% faster than the other players but has less opportunity to communicate (2 credits / round).<h2 class=\"bb_tag\">The “shooter” (green)</h2>They are the multipurpose players, or second line players or semi player; they may have to play all positions, from the front to the back. Cold-blooded calculation, sharp shooting and good communication are the keys skills for this type of player.<br>In the game, those players are green, the master’s color. <br>Shooters have a very accurate shot and a good communication level (3 credits / round).<h2 class=\"bb_tag\">The “tactician” (blue)</h2>The back line is where the player with the most extensive experience resides. He is the voice and eyes of the team. <br>In the game, the Tacticians are in blue, the  color of vision and information. Their main ability is to communicate (5 credits / round) with a unique ability; they can indicate to all their teammates all the opponents they see in the same time. It has a cost: 2 credits out of the 5 they have per point.<h2 class=\"bb_tag\">How to Set Up A Strategy</h2><br>Paintball is not just about being an athlete or having skills; it is also a highly strategic and tactical game. Your strategy needs to be planned and put into motion right from the beginning. The objective is to gain territory with minimal losses. During the game tactics take over, whether it comes to hiding behind bunkers within your safety zone--which is smaller than it appears due to parabolic shooting--or pinning down your adversaries, preventing them from moving, or shooting with another teammate in cross fire to reduce the opposing team’s protection shield. In all cases anticipation and communication will be essential. The Game Provides Just That.<br><br>The Captain, selected randomly, will decide the strategy and give guidance to team before the game begins. The Captain will assign priority skills to all players and for each one, show where to go and where to shoot. The more you practice the more interesting it becomes, very much like in a chess game after you master the main openings. In XFP3 you will decide for a heavy snake side* or heavy dorito side*. <br><br>View demos here and watch Paintball pro player and world champion, Loic Voulot, explain strategy how to set it up in the game.<h2 class=\"bb_tag\">Communication</h2><br>Communication is fundamental in a paintball game. You need to keep track of various information such as player count, position, and moves. Each player has a partial knowledge of what is going on. Timely communication helps make the right decision. Information is an important element for the team. <br><br>3 ways to communicate with your teammates during a round:<br><br>Every player can tell his team (B/V keys):<br>1) What to do, using a communication wheel that provides a selection of main tactics <br>2) What the adversaries are up to, using a communication wheel that provides a selection moves <br>Each of those communications use one of your “communication credits” which is renewed for each round.<br>3) One player, the “tactician” (blue) has a special power. <br>He has capacity to share with his other team players the position of players of the opposing team. When the tactician shares his vision of the adversaries, opposing players icons are displayed on the bunkers where they hide for a few seconds. Be alert. This info is precious.<br>It will cost the “Tactician” 2 communication credits to inform his team.<br><br>There is no need of vocal chat to build efficient team strategy, regardless of the language of your roster.<h2 class=\"bb_tag\">XField Paintball Team and the community</h2>Participate to make this game great<br>Our foremost objective is to create a game that is fun to play. Your participation is quite welcome to improve the gameplay, and the dev team has an ambitious update agenda to work with you on this. We have set up communication tools to be in touch with all of those who want to contribute to improve the game’s future with us. Use Discord, Steam, or our contact online form and express ideas, concerns, constructive critics, suggestions, support, dreams, any of the above…we want it all.<h2 class=\"bb_tag\">Our update plan</h2>Although we have already a few major updates or maps in store for you in the coming weeks and months, we will listen carefully to what you think will make this game great. Among other things we plan to have:<br><ul class=\"bb_ul\"><li>\t1v1 to 5v5 modes already available. Will be open on demand.<br></li><li>\t20 new competition 2017 layouts matching the real international paintball competitions held each year.<br></li><li>\tMore scenario maps (the next one will launch soon). The first is SC Village, California.<br></li><li>\tScoreboard: Even though we already have statistics, the depth of our scoreboard will emerge in the coming weeks with your contribution.<br></li><li>\tThe field configurator will come around when enough players are in the game. It is ready to go and helps you make different types of fields (competition and scenario of different sizes). It also allows for geolocalisation of your field which gives light and shades according to date and time.<br></li><li>\tTeam management.<br></li><li>\tAutonomous Game Servers will be available shortly after the launch. </li></ul><h2 class=\"bb_tag\">The Dev Team</h2>XField Paintball 3 dev team is a mix of seasoned veterans and young talents investing as an indie studio a lot of their time and energy in this project. XFP3 is powered by one of their creations, a custom designed FPS-Sport multiplayer hybrid engine and a new concept of gameplay. Our expectation is to create a new and exciting paintball experience on PC, for paintball fans first, and maybe tomorrow to contribute to the paintball promotion out of its community.<br><br>Thank you for your support and your contribution to XField Paintball Studio.<br>Help us share our passion for the game.<br><br>The XFP3 Team.","about_the_game":"<h2 class=\"bb_tag\">Foreword from the Team</h2><strong>XFP3 is a game in early stage and permanent development with the community.</strong><br><br>Warning: Non paintball players might find this sport gameplay too disruptive compared to traditional FPS.<h2 class=\"bb_tag\">What is now included in XFP3?</h2>- A very realistic paintball physics engine reproducing the unique paintball shooting lines (air friction simulation).<br><br>- Quick play mode (real time multiplayer): 1v1 to 5v5 (adjusted by the dev team to reduce waiting time on servers).<br>- Walk in the Field – WIF (solo mode): For tutorial purpose, or IRL competition paintballers training.<br>- A two phases Gameplay, before and during each round:<br><br>   <strong>1. Before each round - Strategy time: </strong><br>    <ul class=\"bb_ul\">      <li>The captain builds a team strategy and shares it using dedicated communication tools.<br>      </li><li>3 different performance profiles are available:<br>          <ul class=\"bb_ul\">          <li>Tactician with special communication power<br>          </li><li>Rusher with run boost<br>          </li><li>Shooter with accuracy boost<br>          </li></ul>     </li><li>The Captain gives directions to each teammate: where to go and where to shoot…<br>     </li></ul><br>   <strong>2. During each round – Tactical and play time:</strong><br>    <ul class=\"bb_ul\">      <li>Each player uses an original cover mode, with offensive paintball moves (snap, lean, hand switching) while accuracy is boosted vs when running.<br>      </li><li>Each player can use a communication tool for tactics sharing. The tactician is, as IRL, the player who informs the team about opponents’ position. An exclusive power let him do that once a round for a few sec.<br>     </li></ul><br>- Fire rate of 10.5 shots/second and per player (up to 200 simultaneous trajectories).<br>- Official layouts of all international leagues (NXL, Millennium, PALS, CXBL, UWL, SARPL) before the IRL events for training purpose.<br>- Scenario map SC Village.<br>- Progressive low latency servers deployment in USA then in Europe first.<h2 class=\"bb_tag\">What is coming next in matter of days/weeks?</h2>- Server browser (real time multiplayer) : Play 5v5 with friends on your favorite maps.<br>- LAN.<br>- New animation set.<br>- New maps and layouts.<br>- Continuous bug fixing.<h2 class=\"bb_tag\">What is coming next?</h2>- Competitive mode.<br>- Team management.<br>- Field Configurator.<br>- Other community whishes ;-)<h2 class=\"bb_tag\">Why did we make a paintball videogame?</h2><br>Paintball is an amazing sport, offering intense competition and strong team experiences. On the surface it may appear to be a straightforward shooting game, but it is not—strategy is essential for success. Your team’s strategy, tactics and coordination may not be obvious at first sight but make all the difference between mindless shooting and truly playing the sport of paintball.<br><br>There are two more ingredients that make our paintball game unique. The first is realistic ballistics and the second is the maps, or layouts, designed by pros for competitions. The quality of those layouts relies on their real life “level design” that makes them suitable for international competition. We don’t forget the fun of playing on scenario maps with friends where strategy and tactics are also essential.<br><br>The XField Paintball Studio Team wants to create a new video game experience, based on the most realistic and immersive simulation possible of the sport of paintball, including features that reveal the depth and natural gameplay of this sport. The game is developed with pro players to address both the paintball community and the PC player without paintball experience.<br><br>In a nutshell, we want to create the Official Paintball Video Game, based on:<br><ul class=\"bb_ul\"><li>\tA fully immersive technical and design environment.<br></li><li>\tGameplay based on team strategy, tactics and communication.<br></li><li>\tAnd a strong, community-driven update plan.</li></ul><br>Find out below more details on the Gameplay and the Dev Team.<h2 class=\"bb_tag\">**********************************************************************************************</h2><h2 class=\"bb_tag\">The XField Paintball Gameplay</h2><h2 class=\"bb_tag\">Physics As A Gameplay Feature</h2><br>Parabolic shooting provides an amazing in-game experience, quite different from other FPS games. You will need to anticipate every move from your opponent to be a good shooter. The arcing trajectory of a paintball, which is much different than a bullet, allows you to hit an opponent hidden behind the edge of a bunker! The safety zone behind bunkers is smaller than it appears at first sight.<h2 class=\"bb_tag\">Taking Good Cover</h2>It is essential to take good cover and use the shelter that bunkers provide using all sorts of commands such as “change hands” to shoot, lean, snap shots etc…As soon as you get close to the bunker edge or you walk out of cover, you become a shooting target that a good marksman will not miss. This is a one shoot, one kill type of sport, so you want to master bunker’s protection first. Only when your opponent is pinned down under your fire or friendly fire, can you run to your next bunker.<h2 class=\"bb_tag\">Different Player Profiles</h2>Each team is made of several players holding different positions. Each position on the field requires a different mix of the set of skills needed to win (speed, accuracy, communication). The captain chosen at the beginning of each game selects a role for each of the team players according to the planned strategy. Those skills have to be chosen carefully  according to the plan you want to execute.<h2 class=\"bb_tag\">The Captain</h2><br>The Captain, who is chosen randomly at the beginning of each game, designs the strategy and selects all team player profiles, first moves and shooting targets at the beginning of each new round with an easy to use interface:<br><ul class=\"bb_ul\"><li>\tPlayer’s profile (drag &amp; drop selected profile icon on each player)<br></li><li>\tPlayer’s position (move R/L to select player &amp; left click to indicate his position)<br></li><li>\tEach player’s initial shooting target (right click to indicate target)</li></ul><br>All the players of the team can view this, as it is happening and chat live among themselves. We invite players to share and coordinate their strategy at this stage.<br>The Captain’s instruction will be visible up to 15 seconds when the round starts making it easy for each player to memorize his part of the strategy.<br>Team spirit and good communication will help win the game.<h2 class=\"bb_tag\">The 3 Player Profiles (boosted Skills)</h2><img src=\"http://cdn.edgecast.steamstatic.com/steam/apps/377510/extras/Tableau.jpg?t=1498038210\"><h2 class=\"bb_tag\">The “rusher”  (red)</h2>Front players, they run fast, move quickly and are able to play the small and tiny bunkers*, far from the base. They shoot less paint than the second line and third line players. Long distance shooting accuracy is not the main ability of those players. They usually play as front players with an aggressive style; they are creating immediate danger for the opponents. <br>In the game, this kind of player has a red color. <br>He runs 10% faster than the other players but has less opportunity to communicate (2 credits / round).<h2 class=\"bb_tag\">The “shooter” (green)</h2>They are the multipurpose players, or second line players or semi player; they may have to play all positions, from the front to the back. Cold-blooded calculation, sharp shooting and good communication are the keys skills for this type of player.<br>In the game, those players are green, the master’s color. <br>Shooters have a very accurate shot and a good communication level (3 credits / round).<h2 class=\"bb_tag\">The “tactician” (blue)</h2>The back line is where the player with the most extensive experience resides. He is the voice and eyes of the team. <br>In the game, the Tacticians are in blue, the  color of vision and information. Their main ability is to communicate (5 credits / round) with a unique ability; they can indicate to all their teammates all the opponents they see in the same time. It has a cost: 2 credits out of the 5 they have per point.<h2 class=\"bb_tag\">How to Set Up A Strategy</h2><br>Paintball is not just about being an athlete or having skills; it is also a highly strategic and tactical game. Your strategy needs to be planned and put into motion right from the beginning. The objective is to gain territory with minimal losses. During the game tactics take over, whether it comes to hiding behind bunkers within your safety zone--which is smaller than it appears due to parabolic shooting--or pinning down your adversaries, preventing them from moving, or shooting with another teammate in cross fire to reduce the opposing team’s protection shield. In all cases anticipation and communication will be essential. The Game Provides Just That.<br><br>The Captain, selected randomly, will decide the strategy and give guidance to team before the game begins. The Captain will assign priority skills to all players and for each one, show where to go and where to shoot. The more you practice the more interesting it becomes, very much like in a chess game after you master the main openings. In XFP3 you will decide for a heavy snake side* or heavy dorito side*. <br><br>View demos here and watch Paintball pro player and world champion, Loic Voulot, explain strategy how to set it up in the game.<h2 class=\"bb_tag\">Communication</h2><br>Communication is fundamental in a paintball game. You need to keep track of various information such as player count, position, and moves. Each player has a partial knowledge of what is going on. Timely communication helps make the right decision. Information is an important element for the team. <br><br>3 ways to communicate with your teammates during a round:<br><br>Every player can tell his team (B/V keys):<br>1) What to do, using a communication wheel that provides a selection of main tactics <br>2) What the adversaries are up to, using a communication wheel that provides a selection moves <br>Each of those communications use one of your “communication credits” which is renewed for each round.<br>3) One player, the “tactician” (blue) has a special power. <br>He has capacity to share with his other team players the position of players of the opposing team. When the tactician shares his vision of the adversaries, opposing players icons are displayed on the bunkers where they hide for a few seconds. Be alert. This info is precious.<br>It will cost the “Tactician” 2 communication credits to inform his team.<br><br>There is no need of vocal chat to build efficient team strategy, regardless of the language of your roster.<h2 class=\"bb_tag\">XField Paintball Team and the community</h2>Participate to make this game great<br>Our foremost objective is to create a game that is fun to play. Your participation is quite welcome to improve the gameplay, and the dev team has an ambitious update agenda to work with you on this. We have set up communication tools to be in touch with all of those who want to contribute to improve the game’s future with us. Use Discord, Steam, or our contact online form and express ideas, concerns, constructive critics, suggestions, support, dreams, any of the above…we want it all.<h2 class=\"bb_tag\">Our update plan</h2>Although we have already a few major updates or maps in store for you in the coming weeks and months, we will listen carefully to what you think will make this game great. Among other things we plan to have:<br><ul class=\"bb_ul\"><li>\t1v1 to 5v5 modes already available. Will be open on demand.<br></li><li>\t20 new competition 2017 layouts matching the real international paintball competitions held each year.<br></li><li>\tMore scenario maps (the next one will launch soon). The first is SC Village, California.<br></li><li>\tScoreboard: Even though we already have statistics, the depth of our scoreboard will emerge in the coming weeks with your contribution.<br></li><li>\tThe field configurator will come around when enough players are in the game. It is ready to go and helps you make different types of fields (competition and scenario of different sizes). It also allows for geolocalisation of your field which gives light and shades according to date and time.<br></li><li>\tTeam management.<br></li><li>\tAutonomous Game Servers will be available shortly after the launch. </li></ul><h2 class=\"bb_tag\">The Dev Team</h2>XField Paintball 3 dev team is a mix of seasoned veterans and young talents investing as an indie studio a lot of their time and energy in this project. XFP3 is powered by one of their creations, a custom designed FPS-Sport multiplayer hybrid engine and a new concept of gameplay. Our expectation is to create a new and exciting paintball experience on PC, for paintball fans first, and maybe tomorrow to contribute to the paintball promotion out of its community.<br><br>Thank you for your support and your contribution to XField Paintball Studio.<br>Help us share our passion for the game.<br><br>The XFP3 Team.","short_description":"Enter XFP3 indie game adventure, based on our brand new proprietary paintball physics engine. Play an original tactical FPS/Sport gameplay, with exclusive international leagues layouts and scenario maps.","supported_languages":"English<strong>*</strong><br><strong>*</strong>languages with full audio support","header_image":"http://cdn.akamai.steamstatic.com/steam/apps/377510/header.jpg?t=1498038210","website":"http://www.xfield-paintball.com","pc_requirements":{"minimum":"<strong>Minimum:</strong><br><ul class=\"bb_ul\"><li><strong>OS:</strong> Windows 7<br></li><li><strong>Processor:</strong> intel i3<br></li><li><strong>Memory:</strong> 4 GB RAM<br></li><li><strong>Graphics:</strong> Nvidia GTX 760<br></li><li><strong>Network:</strong> Broadband Internet connection<br></li><li><strong>Storage:</strong> 1 GB available space</li></ul>","recommended":"<strong>Recommended:</strong><br><ul class=\"bb_ul\"><li><strong>OS:</strong> Windows 10<br></li><li><strong>Processor:</strong> intel i5<br></li><li><strong>Memory:</strong> 8 GB RAM<br></li><li><strong>Graphics:</strong> Nvidia GTX 770<br></li><li><strong>Network:</strong> Broadband Internet connection<br></li><li><strong>Storage:</strong> 1 GB available space</li></ul>"},"mac_requirements":[],"linux_requirements":[],"developers":["XField Paintball SAS"],"publishers":["XField Paintball SAS"],"price_overview":{"currency":"USD","initial":2999,"final":2999,"discount_percent":0},"packages":[70090],"package_groups":[{"name":"default","title":"Buy XField Paintball 3","description":"","selection_text":"Select a purchase option","save_text":"","display_type":0,"is_recurring_subscription":"false","subs":[{"packageid":70090,"percent_savings_text":"","percent_savings":0,"option_text":"XField Paintball 3 - $29.99","option_description":"","can_get_free_license":"0","is_free_license":false,"price_in_cents_with_discount":2999}]}],"platforms":{"windows":true,"mac":false,"linux":false},"categories":[{"id":1,"description":"Multi-player"},{"id":36,"description":"Online Multi-Player"},{"id":31,"description":"VR Support"}],"genres":[{"id":"1","description":"Action"},{"id":"23","description":"Indie"},{"id":"28","description":"Simulation"},{"id":"18","description":"Sports"}],"screenshots":[{"id":0,"path_thumbnail":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_805c735b88d87d1b85f1ccba5bc0689825298bda.600x338.jpg?t=1498038210","path_full":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_805c735b88d87d1b85f1ccba5bc0689825298bda.1920x1080.jpg?t=1498038210"},{"id":1,"path_thumbnail":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_650b035689be88047aef1957c4ef73bc58001435.600x338.jpg?t=1498038210","path_full":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_650b035689be88047aef1957c4ef73bc58001435.1920x1080.jpg?t=1498038210"},{"id":2,"path_thumbnail":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_6e7d7e2a9ac86dc6b523d8bc4579d24ab4757dda.600x338.jpg?t=1498038210","path_full":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_6e7d7e2a9ac86dc6b523d8bc4579d24ab4757dda.1920x1080.jpg?t=1498038210"},{"id":3,"path_thumbnail":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_326d43968e04a16004247b6e08ada858dacbaae9.600x338.jpg?t=1498038210","path_full":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_326d43968e04a16004247b6e08ada858dacbaae9.1920x1080.jpg?t=1498038210"},{"id":4,"path_thumbnail":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_07f3a14a77909ff3c43d20051ca2e11f7f5c30c2.600x338.jpg?t=1498038210","path_full":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_07f3a14a77909ff3c43d20051ca2e11f7f5c30c2.1920x1080.jpg?t=1498038210"},{"id":5,"path_thumbnail":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_6388892a688a12ab3fc0ee9ac5d1f604b50d4099.600x338.jpg?t=1498038210","path_full":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_6388892a688a12ab3fc0ee9ac5d1f604b50d4099.1920x1080.jpg?t=1498038210"},{"id":6,"path_thumbnail":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_dfb4096d6236f81a10d499d343909b44c7f69dae.600x338.jpg?t=1498038210","path_full":"http://cdn.akamai.steamstatic.com/steam/apps/377510/ss_dfb4096d6236f81a10d499d343909b44c7f69dae.1920x1080.jpg?t=1498038210"}],"movies":[{"id":256686039,"name":"Xfield Paintball 3 - Trailer","thumbnail":"http://cdn.akamai.steamstatic.com/steam/apps/256686039/movie.293x165.jpg?t=1496172208","webm":{"480":"http://cdn.akamai.steamstatic.com/steam/apps/256686039/movie480.webm?t=1496172208","max":"http://cdn.akamai.steamstatic.com/steam/apps/256686039/movie_max.webm?t=1496172208"},"highlight":true},{"id":256686014,"name":"Xfield Paintball 3 Overview","thumbnail":"http://cdn.akamai.steamstatic.com/steam/apps/256686014/movie.293x165.jpg?t=1496172213","webm":{"480":"http://cdn.akamai.steamstatic.com/steam/apps/256686014/movie480.webm?t=1496172213","max":"http://cdn.akamai.steamstatic.com/steam/apps/256686014/movie_max.webm?t=1496172213"},"highlight":true},{"id":256686315,"name":"Strategy in XFP3","thumbnail":"http://cdn.akamai.steamstatic.com/steam/apps/256686315/movie.293x165.jpg?t=1496383172","webm":{"480":"http://cdn.akamai.steamstatic.com/steam/apps/256686315/movie480.webm?t=1496383172","max":"http://cdn.akamai.steamstatic.com/steam/apps/256686315/movie_max.webm?t=1496383172"},"highlight":true}],"achievements":{"total":0},"release_date":{"coming_soon":false,"date":"May 30, 2017"},"support_info":{"url":"https://xfieldpaintball.zendesk.com/hc/en-us/requests/new","email":"support@xfield-paintball.com"},"background":"http://cdn.akamai.steamstatic.com/steam/apps/377510/page_bg_generated_v6b.jpg?t=1498038210"}